In [2]:
import pandas as pd
employees = pd.read_csv (r'C:\Users\firne\bip-python-unh\user_audit\data\employees.csv')
system = pd.read_csv (r'C:\Users\firne\bip-python-unh\user_audit\data\system_access.csv')
system.rename(columns={'id':'employee_number'}, inplace=True)
employees.head()

,employee_number,first_name,last_name,email,title
0,EMP003037,Juliana,Burbudge,juliana.burbudge@consultants.com,Director of Sales
1,EMP003045,Lizzie,Blue,lizzie.blue@consultants.com,Sales Assistant
2,EMP003051,Marjory,Selcraig,marjory.selcraig@consultants.com,Sales Assistant
3,EMP003068,Aguste,O'Connor,aguste.o'connor@consultants.com,Sales Assistant
4,EMP003097,Clemens,Kopman,clemens.kopman@consultants.com,Account Manager

In [3]:
system['employee_number'] = system['employee_number'].astype(str)
system['employee_number'] = system['employee_number'].apply(lambda x: x.zfill(6))
employees['employee_number'] = employees['employee_number'].str[3:]

In [4]:
employees.set_index('employee_number', inplace=True)
system.set_index('employee_number', inplace=True)
df = employees.join(system, how= 'left')
system['access_level'] = system['access_level'].astype(str)
df.head()

,first_name,last_name,email,title,access_level
employee_number,,,,,
003037,Juliana,Burbudge,juliana.burbudge@consultants.com,Director of Sales,NaN
003045,Lizzie,Blue,lizzie.blue@consultants.com,Sales Assistant,Contract Entry
003051,Marjory,Selcraig,marjory.selcraig@consultants.com,Sales Assistant,Contract Entry
003068,Aguste,O'Connor,aguste.o'connor@consultants.com,Sales Assistant,Contract Entry
003097,Clemens,Kopman,clemens.kopman@consultants.com,Account Manager,Account Admin

In [10]:
df.isnull().any()
nd = df[df.isnull().any(axis=1)]
nd.head()

,first_name,last_name,email,title,access_level
employee_number,,,,,
003291,Gweneth,Abbate,gweneth.abbate@consultants.com,Account Manager,NaN
003713,Marybeth,Driussi,marybeth.driussi@consultants.com,Account Manager,NaN
003941,Franciskus,Langland,franciskus.langland@consultants.com,Account Manager,NaN
004461,Josselyn,Ivanchov,josselyn.ivanchov@consultants.com,Sales Assistant,NaN
004948,Ted,McNabb,ted.mcnabb@consultants.com,Sales Assistant,NaN

In [11]:
df.loc[df['title'] == "Director of Sales", 'access_level'] = "Approval-Manager"
df.loc[df['title'] == "Account Manager", 'access_level'] = "Account Admin"
df.loc[df['title'] == "Sales Assistant", 'access_level'] = "Contract Entry"
df.head()

,first_name,last_name,email,title,access_level
employee_number,,,,,
003037,Juliana,Burbudge,juliana.burbudge@consultants.com,Director of Sales,Approval-Manager
003045,Lizzie,Blue,lizzie.blue@consultants.com,Sales Assistant,Contract Entry
003051,Marjory,Selcraig,marjory.selcraig@consultants.com,Sales Assistant,Contract Entry
003068,Aguste,O'Connor,aguste.o'connor@consultants.com,Sales Assistant,Contract Entry
003097,Clemens,Kopman,clemens.kopman@consultants.com,Account Manager,Account Admin

In [4]:
#what is supposed to be in the CSV file we're uploading?
df.to_csv(r'C:\Users\firne\bip-python-unh\user_audit\Final.csv')

NameError: name 'nd' is not defined